# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12x object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-x

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  x: [1.25, 2.00, 1024]  # summary: 895 layers, 120,000,000+ parameters, 120,000,000 gradients, 400 GFLOPs

# YOLO12-x backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 3, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 6, A2C2f, [1024, True, 1]]  # 8

# YOLO12-x head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, A2C2f, [512, False, -1]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, A2C2f, [256, False, -1]]  # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, A2C2f, [512, False, -1]]  # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C3k2, [1024, True]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)
